<?php
$action = !empty($_GET['action']) ? $_GET['action'] : '';
switch ($action) {
    case '1':
        $arr = array(
            'status' => 1,
            'msg' => "访问成功",
            'data' => array(
                'month' => array('一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'),
                'datas1' => array(880, 677, 899, 999, 980, 889, 994, 898, 789, 889, 787, 989),
                'datas2' => array(209, 687, 992, 990, 970, 899, 904, 891, 780, 889, 887, 970),
                'datas3' => array(200, 300, 500, 100, 400, 300, 200, 100, 40, 90, 50, 20)
            )
        );
        echo json_encode($arr);
        break;
    case '2':
        $arr = array(
            'status' => 1,
            'msg' => "访问成功",
            'data' => array(
                'day' => array('01', '02', '03', '04', '05', '06', '07', '08', '09', '10'),
                'datas1' => array(880, 677, 899, 999, 980, 889, 994, 898, 789, 889),
                'datas2' => array(209, 687, 992, 990, 970, 899, 904, 891, 780, 889),
                'datas3' => array(200, 300, 500, 100, 400, 300, 200, 100, 40, 90)
            )
        );
        echo json_encode($arr);
        break;
}
